# GetNodeByIndex Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalModelData..::..GetNodeByIndex Method
MEPAnalyticalModelData Class See Also
---
Gets the specified analytical node.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public MEPAnalyticalNode GetNodeByIndex(
	int index
)
```

Visual Basic
---
```text
Public Function GetNodeByIndex ( _
	index As Integer _
) As MEPAnalyticalNode
```

Visual C++
---
```text
public:
MEPAnalyticalNode^ GetNodeByIndex(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The node index number by their storing sequence, starting from 0.
# ### Return Value
The returned analytical node.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The index must range from 0 to GetNumberOfNodes()-1. |

# See Also
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace